# -*- coding: utf-8 -*-
"""complete_task_2.4

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1P90aDQ_k4mZVoaJs9hDc7FLVlvRZJvTm
"""

# Задача 2.2.

# Напишите функцию, которая возвращает номер квартал по номеру месяца
# Например:
# месяц 2 (февраль) является частью первого квартала;
# месяц 6 (июнь) является частью второго квартала;
# месяц 11 (ноябрь) является частью четвертого квартала.

def quarter_of(month):
    if month == 1:
      return 'Месяц 1 (январь) является частью первого квартала'
    elif month == 2:
      return 'Месяц 2 (февраль) является частью первого квартала'
    elif month == 3:
      return 'Месяц 3 (март) является частью первого квартала'
    elif month == 4:
      return ' Месяц 4 (апрель) является частью второго квартала'
    elif month == 5:
      return ' Месяц 5 (май) является частью второго квартала'
    elif month == 6:
      return ' Месяц 6 (июнь) является частью второго квартала'
    elif month == 7:
      return 'Месяц 7 (июль) является частью третьего квартала'
    elif month == 8:
      return 'Месяц 8 (август) является частью третьего квартала'
    elif month == 9:
      return 'Месяц 9 (сентябрь) является частью третьего квартала'
    elif month == 10:
      return 'Месяц 10 (октябрь) является частью четвертого квартала'
    elif month == 11:
      return 'Месяц 11 (ноябрь) является частью четвертого квартала'
    elif month == 12:
      return 'Месяц 12 (декабрь) является частью четвертого квартала'
month = int(input("Введите номер месяца:"))
print(quarter_of(month))