# -*- coding: utf-8 -*-
"""complete_task_2.3.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1XHAOSOyod3yPjhiw1rh5Zi_6D_5UlU6I
"""

# Задача 2.3.

# Напишите функцию, которая принимает цифры от 0 до 9 и возвращает значение прописью.
# Например,
# switch_it_up(1) -> 'One'
# switch_it_up(3) -> 'Three'
# switch_it_up(10000) -> None
# Использовать условный оператор if-elif-else нельзя!

def switch_it_up(number):
  r=['ноль','один','два','три','четыре','пять','шесть', 'семь','восемь','девять']
  return r[number]
n=int(input("введите число от 0 до 9 "))
print(switch_it_up(n))